nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_spi_gy912_demo.c
static uint32_t gy912_spi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  uint32_t regval;
  uint32_t ret;

  DEBUGASSERT(priv && priv->spibase);

  /* Write the data to transmit to the SPI Data Register */
  if (priv->nbits <= 8)
    {
      gy912_spi_putreg8(priv, RA8E1_SPI_SPDR_OFFSET, (uint8_t)wd);
    }
  else
    {
      gy912_spi_putreg16(priv, RA8E1_SPI_SPDR_OFFSET, (uint16_t)wd);
    }

  /* Wait until the transfer is complete */
  do
    {
      regval = gy912_spi_getreg8(priv, RA8E1_SPI_SPSR_OFFSET);
    }
  while ((regval & RA8E1_SPI_SPSR_SPTEF) == 0);

  /* Wait for receive data */
  do
    {
      regval = gy912_spi_getreg8(priv, RA8E1_SPI_SPSR_OFFSET);
    }
  while ((regval & RA8E1_SPI_SPSR_SPRF) == 0);

  /* Read the received data */
  if (priv->nbits <= 8)
    {
      ret = gy912_spi_getreg8(priv, RA8E1_SPI_SPDR_OFFSET);
    }
  else
    {
      ret = gy912_spi_getreg16(priv, RA8E1_SPI_SPDR_OFFSET);
    }

  spiinfo("Sent: %04x Return: %04x Status: %02x\n", wd, ret, regval);
  return ret;
}

/****************************************************************************
 * Name: gy912_spi_exchange
 *
 * Description:
 *   Exchange a block of data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.  If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gy912_spi_exchange(struct spi_dev_s *dev, const void *txbuffer,
                               void *rxbuffer, size_t nwords)
{
  struct gy912_spidev_s *priv = (struct gy912_spidev_s *)dev;
  struct gy912_spi_transfer_s xfer;

  DEBUGASSERT(priv && priv->spibase);

  spiinfo("txbuffer=%p rxbuffer=%p nwords=%d\n", txbuffer, rxbuffer, nwords);

  /* Set up transfer structure */
  memset(&xfer, 0, sizeof(xfer));
  xfer.txbuffer = txbuffer;
  xfer.rxbuffer = rxbuffer;
  xfer.nwords = nwords;
  xfer.width = priv->nbits;
  xfer.status = RA8E1_SPI_STATUS_IDLE;

  /* Use DMA for large transfers if available */
  if (nwords > 16 && !priv->dma_active)
    {
      if (gy912_spi_transfer_dma(dev, &xfer) == OK)
        {
          return;
        }
      /* Fall back to polling if DMA fails */
    }

  /* Use polling mode */
  gy912_spi_transfer_polling(dev, &xfer);
}

#ifndef CONFIG_SPI_EXCHANGE

/****************************************************************************
 * Name: gy912_spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   nwords   - the length of data to send from the buffer in number of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gy912_spi_sndblock(struct spi_dev_s *dev, const void *txbuffer,
                               size_t nwords)
{
  spiinfo("txbuffer=%p nwords=%d\n", txbuffer, nwords);
  return gy912_spi_exchange(dev, txbuffer, NULL, nwords);
}

/****************************************************************************
 * Name: gy912_spi_recvblock
 *
 * Description:
 *   Receive a block of data from SPI
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - the length of data that can be received in the buffer in number
 *              of words.  The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gy912_spi_recvblock(struct spi_dev_s *dev, void *rxbuffer,
                                size_t nwords)
{
  spiinfo("rxbuffer=%p nwords=%d\n", rxbuffer, nwords);
  return gy912_spi_exchange(dev, NULL, rxbuffer, nwords);
}

#endif /* !CONFIG_SPI_EXCHANGE */

/****************************************************************************
 * Name: gy912_spi_bus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus in its default state (Master, 8-bit,
 *   mode 0, etc.)
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gy912_spi_bus_initialize(struct gy912_spidev_s *priv)
{
  uint8_t regval;
  uint16_t spcmd;

  /* Configure the SPI pins */
  ra_configgpio(GPIO_SPI0_SCK);
  ra_configgpio(GPIO_SPI0_MOSI);
  ra_configgpio(GPIO_SPI0_MISO);
  ra_configgpio(GPIO_SPI0_SS0);
  ra_configgpio(GPIO_SPI0_BMP_CS);

  /* Enable SPI0 clock */
  modifyreg32(RA8_SYSTEM_MSTPCRB, RA8E1_MSTP_SPI0, 0);

  /* Disable SPI function */
  gy912_spi_putreg8(priv, RA8E1_SPI_SPCR_OFFSET, 0);

  /* Configure SPI Control Register */
  regval = RA8E1_SPI_SPCR_MSTR |    /* Master mode */
           RA8E1_SPI_SPCR_SPE;      /* SPI function enable */
  gy912_spi_putreg8(priv, RA8E1_SPI_SPCR_OFFSET, regval);

  /* Configure SPI Command Register 0 */
  spcmd = RA8E1_SPI_SPCMD_SPB_8 |   /* 8-bit data length */
          (0 << 4);                 /* SSL0 assertion */
  gy912_spi_putreg16(priv, RA8E1_SPI_SPCMD0_OFFSET, spcmd);

  /* Set default configuration */
  priv->frequency = 0;
  priv->mode = SPIDEV_MODE0;
  priv->nbits = 8;

  /* Set the initial SPI configuration */
  gy912_spi_setmode((struct spi_dev_s *)priv, SPIDEV_MODE0);
  gy912_spi_setbits((struct spi_dev_s *)priv, 8);
  gy912_spi_setfrequency((struct spi_dev_s *)priv, 400000);

  /* Initialize CS pins to deasserted state */
  ra_gpiowrite(GPIO_SPI0_SS0, true);
  ra_gpiowrite(GPIO_SPI0_BMP_CS, true);

  priv->initialized = true;
}

/****************************************************************************
 * Name: gy912_spi_dma_setup
 *
 * Description:
 *   Setup DMA for SPI transfers
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

int gy912_spi_dma_setup(void)
{
  /* Enable DTC clock */
  modifyreg32(RA8_SYSTEM_MSTPCRB, RA8E1_MSTP_DTC, 0);

  /* Initialize DTC */
  putreg32(0x00000001, RA8E1_DTC_BASE + RA8E1_DTC_DTCST_OFFSET);

